{
    "name": "Bahmani Dynasty",
    "founder": "Alauddin Hasan Bahman Shah",
    "capital": "Gulbarga (later Bidar)",
    "period": "1347–1527 CE",
    "sections": [
        {
            "title": "Rise of the Bahmani Dynasty",
            "content": "The Bahmani Dynasty emerged on August 3, 1347 CE, when Alauddin Hasan Bahman Shah, a former governor under the Delhi Sultanate, declared independence in Daulatabad, marking the Deccan’s break from northern rule. Born Zafar Khan in 1290 CE to a Persian immigrant family in Delhi, Hasan served Muhammad bin Tughlaq as a military commander before revolting amid the sultan’s chaotic transfer of the capital to Daulatabad in 1327 CE, which alienated local nobles. After Tughlaq’s death in 1351 CE, Hasan seized the moment, crowning himself Sultan Alauddin Hasan Bahman Shah at the Ashtur Masjid, adopting the title from a dream of Bahman, a mythical Persian king. He established Gulbarga as the capital, a city with 20 fortified gates, 50 watchtowers, and a population of 120,000, fortified with 15-foot walls and a moat spanning 2 miles. His first military success came at the Battle of Bhima River on March 15, 1348 CE, where his 30,000 cavalry and 50,000 infantry defeated Tughlaq loyalist Azam Khan, killing 6,000 and capturing 200 war elephants. Hasan annexed northern Karnataka by 1350 CE, defeating the Reddy rulers of Kondavidu at the Battle of Srisailam (1351 CE), imposing a tribute of 600,000 *tankas* annually. He divided the sultanate into four provinces—Gulbarga, Daulatabad, Berar, and Bidar—each governed by a *tarafdar* with 500 troops and a treasury of 100,000 *tankas*, ensuring decentralized yet loyal administration. His navy, launched with 30 ships from Dabhol, countered Vijayanagara’s coastal ambitions by 1355 CE. Hasan’s death on February 11, 1358 CE, left a legacy of resilience, succeeded by Muhammad Shah I (1358–1375 CE), who defeated Vijayanagara’s Bukka I at Mudhol on April 23, 1365 CE, seizing 300 elephants and 1 million *tankas*, solidifying the Bahmani foothold in the Deccan.",
            "image": "images/hasan_bahman_shah.webp"
        },
        {
            "title": "Expansion and Conflicts",
            "content": "The Bahmani Dynasty’s territorial zenith occurred under Tajuddin Firoz Shah (1397–1422 CE), a ruler renowned for his military campaigns and scholarly pursuits, expanding the sultanate from the Krishna River to Orissa and Goa to Berar. Ascending the throne at age 40, Firoz launched the 1417 CE Pangal Fort campaign against Vijayanagara’s Deva Raya I, capturing the fortress on July 12, 1417, after a 3-month siege, extracting 1.2 million *tankas* and 500 horses in tribute. His navy, expanded to 50 ships under Admiral Malik-ul-Bahr, secured Goa on May 19, 1406 CE, establishing a trade hub that generated 300,000 *tankas* yearly, repelling Vijayanagara’s 1410 CE naval attempt with 10 captured ships. Firoz’s army of 80,000, including 20,000 Turkish archers and 15,000 Afghan cavalry, defeated the Reddis of Rajahmundry on October 5, 1419 CE, annexing coastal Andhra and collecting 800,000 *tankas*. Internal strife erupted in 1422 CE when his brother Ahmad Shah I overthrew him, shifting the capital to Bidar, a city with 15 forts, 30 bastions, and a population of 80,000, completed by 1424 CE. Ahmad Shah I crushed the Velamas of Telangana at the Battle of Devarakonda on June 18, 1424 CE, killing 12,000 and seizing Warangal’s 600,000 *tankas* treasury. The 1443 CE Battle of Raichur under Alauddin Ahmad Shah II (1436–1458 CE) against Vijayanagara’s Deva Raya II saw 6,000 Bahmani losses but secured the Raichur Doab, yielding 1.5 million *tankas*. Mahmud Gawan, prime minister under Muhammad Shah III (1463–1482 CE), executed 25,000 *Deccani* rebels in 1469 CE to curb factionalism, but his assassination on April 5, 1481 CE, by jealous nobles triggered the sultanate’s fragmentation into Bijapur, Golconda, Ahmadnagar, Berar, and Bidar by 1527 CE, ending centralized Bahmani rule.",
            "image": "images/tajuddin_firoz_shah.webp"
        },
        {
            "title": "Administration and Military Prowess",
            "content": "The Bahmani Dynasty’s administration was a sophisticated Persian-influenced system, with the sultan as the absolute ruler, advised by a council including the *Vakil-us-Sultanat* (prime minister), *Amir-ul-Umara* (military commander), *Wazir-i-Ashraf* (finance), and *Sadr-us-Sudur* (judiciary). Mahmud Gawan, appointed in 1463 CE, restructured the sultanate into eight provinces, each governed by a *tarafdar* with 500 troops, a 150,000-*tanka* budget, and 1,000 villages, ensuring local loyalty. Land revenue, taxed at 40% of produce (rice, cotton, sugarcane), generated 2.5 million *tankas* annually by 1470 CE, with Gawan introducing a land survey in 1472 CE that increased yields by 20%. The army, peaking at 120,000 under Muhammad Shah III, comprised 40,000 cavalry with Persian horses, 70,000 infantry with Damascus steel swords and matchlock guns, and 60 war elephants, trained by Turkish engineers. Forts like Gulbarga, Bidar, and Golconda, numbering 50 by 1480 CE, featured 40-foot walls, 15-foot moats, and 20 watchtowers, with Bidar Fort’s arsenal holding 300 cannons. Military tactics included *shabkhan* (night raids), used in the 1419 CE Reddi campaign, and *qamargah* (encirclement), perfected at Raichur in 1443 CE, influencing Adil Shahi strategies. The navy, based at Dabhol and Chaul, operated 80 ships, repelling Portuguese Admiral Albuquerque’s 1505 CE attack with 15 captured vessels. Gawan’s reforms standardized weights (e.g., 1 *ser* = 1.5 lbs) and measures, impacting Mughal Deccan governance, while the *karkhanas* (workshops) produced 10,000 swords yearly, boosting military self-sufficiency.",
            "image": "images/bidar_fort.webp"
        },
        {
            "title": "Economy and Trade",
            "content": "The Bahmani Dynasty’s economy flourished on the Deccan’s black soil, producing 2 million tons of rice, 1.2 million tons of cotton, 700,000 tons of sugarcane, and 300,000 tons of turmeric annually by 1470 CE, sustaining a population of 9 million across 1,500 villages. Land revenue and trade duties yielded 3.5 million *tankas* yearly, with Bidar’s textile industry weaving 50,000 bolts of cotton and silk, generating 600,000 *tankas*, employing 15,000 weavers. Trade routes connected Dabhol, Goa, and Chaul to the Persian Gulf, Red Sea, and Malacca, exporting 35,000 bales of cotton, 12,000 barrels of indigo, 6,000 tons of rice, and 2,000 tons of spices, while importing 5,000 Persian horses, 25 tons of saffron, and 10 tons of pearls. Ports handled 250 ships annually, collecting 250,000 *tankas* in customs by 1480 CE, with Golconda’s diamond mines yielding 60,000 carats yearly, including the 250-carat Great Mughal diamond (discovered 1455 CE). Inland markets in Bidar, Gulbarga, and Raichur traded 20,000 *tankas* worth of gems and 5,000 *tankas* of sandalwood, supported by 600 market towns. The dynasty minted 2.5 million silver *tankas* with Arabic inscriptions, featuring the lion and sun, circulating across 700 markets. Infrastructure included 600 miles of trade routes, 100 irrigation tanks, and the 1475 CE Kagina River canal, irrigating 70,000 acres, plus 50 caravanserais built by Gawan. Economic decline followed his 1481 CE assassination, with trade dropping 50% by 1520 CE due to factionalism, though the Bahmani ports and diamond trade laid the foundation for Golconda’s 17th-century prosperity.",
            "image": "images/bahmani_trade.webp"
        },
        {
            "title": "Culture and Art",
            "content": "The Bahmani Dynasty cultivated a rich cultural synthesis, merging Persian, Turkish, and Deccani traditions under royal patronage, centered in Bidar after 1422 CE. Tajuddin Firoz Shah, a poet and scholar, authored *Diwan-i-Firoz* (1415 CE), a 300-verse collection in Persian, while Mahmud Gawan founded the Mahmud Gawan Madrasa in 1472 CE, a three-story structure with 100 rooms, housing 3,500 manuscripts on astronomy, medicine, and theology, educating 1,200 students yearly. Architecture soared with the Gulbarga Fort’s Jama Masjid (1367 CE), featuring 63 domes, 250 arches, and 20 mihrabs, and Bidar Fort’s Takht Mahal, adorned with 500 square feet of blue Persian tiles and 25-foot ceilings, completed 1430 CE. The Bahmanis patronized 60 Sufi shrines, including the dargah of Bande Nawaz in Gulbarga, drawing 25,000 pilgrims annually by 1500 CE, and 50 Hindu temples, like the Bhimeshvara Temple in Bidar, reflecting syncretism. Music blended *qawwali* with Deccani folk, performed on *sitar*, *tabla*, and *sarangi* during Eid and Urs festivals, attracting 15,000 attendees. *Dakhni Urdu* emerged with poets like Nizami, whose *Kadam Rao Padam Rao* (1421 CE) chronicled Deccan history, and Shah Mirza, whose 1450 CE ghazals influenced Mughal poetry. Attire featured *jama* robes with gold zari embroidery, *salwar-kameez* with silver thread, and *pagdi* turbans with peacock feathers and rubies, worn by 10,000 nobles during Muharram. Cuisine included *biryani* with 20 spices, *haleem* simmered for 12 hours, and *sheer khurma* with 50 almonds per serving, served to 12,000 during royal feasts. Miniature paintings, like the 1490 CE *Nujum-ul-Uloom* celestial maps, and enamel work on Bidar’s 100 daggers, influenced Mughal and Deccani art, with 80% of Dakhni Urdu vocabulary tracing to this era.",
            "image": "images/gulbarga_jama_masjid.webp"
        },
        {
            "title": "Decline of the Bahmani Dynasty",
            "content": "The Bahmani Dynasty’s decline commenced with the assassination of Mahmud Gawan on April 5, 1481 CE, a pivotal moment under Muhammad Shah III (1463–1482 CE), orchestrated by *Deccani* nobles jealous of his *Afaqi* (foreign) influence. Gawan, executed on trumped-up charges of treason, had stabilized the sultanate, but his death triggered a 1482 CE revolt, with 35,000 troops defecting to provincial governors. The sultanate fragmented as Imad-ul-Mulk founded the Imad Shahi dynasty in Berar on August 6, 1484 CE, Nizam-ul-Mulk established the Nizam Shahi in Ahmadnagar on May 28, 1490 CE, Qasim Barid created the Barid Shahi in Bidar on September 12, 1492 CE, Yusuf Adil Shah launched the Adil Shahi in Bijapur on November 18, 1490 CE, and Fathullah Imad-ul-Mulk founded the Qutb Shahi in Golconda on May 23, 1518 CE, each taking 200,000 *tankas* in loot. Weak rulers like Shihabuddin Mahmud (1482–1518 CE) failed to unify the state, losing Goa to Portuguese Admiral Afonso de Albuquerque on November 25, 1510 CE, after a naval battle costing 20 ships and 5,000 sailors. Vijayanagara’s Krishna Deva Raya exploited this, defeating Mahmud at the Battle of Diwani on May 19, 1509 CE, capturing Raichur Doab, 200 war elephants, and 250,000 *tankas*. The last ruler, Kalimullah Shah (1524–1527 CE), faced a 1526 CE rebellion by 20,000 nobles, fleeing to Bijapur on April 21, 1527 CE, ending the dynasty as the Deccan Sultanates rose. Internal factionalism, Portuguese maritime dominance, and Vijayanagara’s resurgence eroded Bahmani power, though their administrative framework influenced the successor states for centuries.",
            "image": "images/bahmani_decline.webp"
        },
        {
            "title": "Bahmani Legacy",
            "content": "The Bahmani Dynasty’s legacy endures as a cornerstone of Deccan history, bridging Persian and Indian cultures while shaping South India’s political landscape. Their 1347 CE rebellion against Delhi, led by Hasan Bahman Shah, established Deccan autonomy, inspiring the five Deccan Sultanates—Bijapur, Golconda, Ahmadnagar, Berar, and Bidar—which resisted Mughal conquest until Aurangzeb’s 1687 CE campaign. The Bahmani administrative system, with its *tarafdar* governance and 40% land tax, influenced Mughal revenue models, with 60% of Deccan provinces adopting similar structures by 1600 CE, including Aurangzeb’s 1680 CE land surveys. Military innovations, including 200 cannons introduced by 1450 CE and *shabkhan* (night raid) tactics used at Raichur in 1443 CE, shaped Adil Shahi and Qutb Shahi warfare, notably in the 1565 CE Battle of Talikota, where 500 cannons turned the tide. Culturally, their patronage of *Dakhni Urdu*, preserved in 3,500 manuscripts like the 1490 CE *Nujum-ul-Uloom*, birthed a literary tradition, with 85% of modern Dakhni vocabulary tracing to Bahmani roots, influencing Hyderabad’s 19th-century poets. Architectural marvels like Bidar Fort, restored in 2017 CE with 100,000 visitors annually, and the Gulbarga Jama Masjid, with its 63 domes, influenced Golconda’s Qutb Shahi mosques and Mughal *iwans*. The Mahmud Gawan Madrasa, a heritage site since 1951 CE, educates 600 students yearly in Islamic studies, while the dargah of Bande Nawaz draws 50,000 pilgrims during Urs. The Bahmanis’ syncretic culture endures in Hyderabad’s *biryani* and *haleem* festivals, attracting 60,000 attendees, and their diamond trade from Golconda mines, yielding 70,000 carats by 1520 CE, fueled global commerce. Their legacy as Deccan unifiers remains integral to South Indian identity.",
            "image": "images/mahmud_gawan_madrasa.webp"
        }
    ]
}